/*
Navicat MySQL Data Transfer

Source Server         : Taiwan Server
Source Server Version : 50140
Source Host           : localhost:3366
Source Database       : l1jtw_db

Target Server Type    : MYSQL
Target Server Version : 50140
File Encoding         : 65001

Date: 2011-05-18 17:21:00
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for weapon_skill
-- ----------------------------
CREATE TABLE `weapon_skill` (
  `weapon_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `note` varchar(255) DEFAULT NULL,
  `probability` int(11) unsigned NOT NULL DEFAULT '0',
  `fix_damage` int(11) unsigned NOT NULL DEFAULT '0',
  `random_damage` int(11) unsigned NOT NULL DEFAULT '0',
  `area` int(11) NOT NULL DEFAULT '0',
  `skill_id` int(11) unsigned NOT NULL DEFAULT '0',
  `skill_time` int(11) unsigned NOT NULL DEFAULT '0',
  `effect_id` int(11) unsigned NOT NULL DEFAULT '0',
  `effect_target` int(11) unsigned NOT NULL DEFAULT '0',
  `arrow_type` int(11) unsigned NOT NULL DEFAULT '0',
  `attr` int(11) unsigned NOT NULL DEFAULT '0',
  `gfx_id` int(11) unsigned NOT NULL DEFAULT '0',
  `gfx_id_target` int(1) unsigned NOT NULL DEFAULT '1',
  `formula_type` varchar(32) NOT NULL DEFAULT 'FIXED_RANDOM',
  `enabled` tinyint(1) unsigned NOT NULL DEFAULT '1',
  `str_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `dex_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `int_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `sp_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `random_stat_mask` int(11) unsigned NOT NULL DEFAULT '0',
  `random_stat_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `enchant_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `enchant_trigger_rate` decimal(8,3) unsigned NOT NULL DEFAULT '0.000',
  `enchant_trigger_start_level` int(11) unsigned NOT NULL DEFAULT '0',
  `buff_skill_id` int(11) unsigned NOT NULL DEFAULT '0',
  `buff_stat_mask` int(11) unsigned NOT NULL DEFAULT '0',
  `buff_stat_rate` decimal(8,3) NOT NULL DEFAULT '0.000',
  `mr_penetration` decimal(5,2) unsigned NOT NULL DEFAULT '0.00',
  `attr_penetration` decimal(5,2) unsigned NOT NULL DEFAULT '0.00',
  `area_center` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `area_pvp_protection` tinyint(1) unsigned NOT NULL DEFAULT '1',
  `effect_type` tinyint(1) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`weapon_id`)
) ENGINE=MyISAM AUTO_INCREMENT=316 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `weapon_skill` VALUES ('47', '沉默之劍', '2', '0', '0', '0', '64', '16', '2177', '0', '0', '0', '0', '1', 'STATUS_ONLY', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('54', '克特之劍', '15', '35', '25', '0', '0', '0', '10', '0', '0', '8', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('58', '死亡騎士烈炎之劍', '7', '75', '15', '0', '0', '0', '1811', '0', '0', '2', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('76', '倫得雙刀', '15', '35', '25', '0', '0', '0', '1805', '0', '0', '1', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('121', '冰之女王魔杖', '25', '95', '55', '0', '0', '0', '1810', '0', '0', '4', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('203', '炎魔的雙手劍', '15', '90', '90', '2', '0', '0', '762', '0', '0', '2', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('205', '熾炎天使弓', '5', '8', '0', '0', '0', '0', '6288', '0', '1', '0', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('256', '萬聖節南瓜長劍', '8', '35', '25', '0', '0', '0', '2750', '0', '0', '1', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('257', '萬聖節長劍', '8', '35', '25', '0', '0', '0', '2750', '0', '0', '1', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('258', '終極萬聖節南瓜長劍', '8', '35', '25', '0', '0', '0', '2750', '0', '0', '1', '0', '1', 'FIXED_RANDOM', '1', '0.000', '0.000', '0.000', '0.000', '0', '0.000', '0.000', '0.000', '0', '0', '0', '0.000', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('289', '耀武短劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('290', '耀武雙手劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('291', '耀武雙刀', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('292', '耀武之弩', '14', '0', '0', '0', '0', '0', '129', '0', '1', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('293', '耀武魔杖', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('294', '特製的耀武短劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('295', '特製的耀武雙手劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('296', '特製的耀武雙刀', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('297', '特製的耀武之弩', '14', '0', '0', '0', '0', '0', '129', '0', '1', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('298', '特製的耀武魔杖', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('299', '超特製的耀武短劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('300', '超特製的耀武雙手劍', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('301', '超特製的耀武雙刀', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('302', '超特製的耀武之弩', '14', '0', '0', '0', '0', '0', '129', '0', '1', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('303', '超特製的耀武魔杖', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('124', '巴風特魔杖', '14', '0', '0', '0', '0', '0', '129', '0', '0', '1', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.800', '1.800', '12', '1.800', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '1');
INSERT INTO `weapon_skill` VALUES ('260', '狂風之斧', '4', '0', '0', '4', '0', '0', '758', '1', '0', '8', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.500', '1.500', '12', '1.500', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '1', '0', '0');
INSERT INTO `weapon_skill` VALUES ('263', '酷寒之矛', '5', '0', '0', '3', '0', '0', '1804', '0', '0', '4', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.400', '1.400', '12', '1.400', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '0', '0');
INSERT INTO `weapon_skill` VALUES ('264', '雷雨之劍', '4', '0', '0', '0', '0', '0', '10', '0', '0', '8', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '2.000', '2.000', '12', '2.000', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '0');
INSERT INTO `weapon_skill` VALUES ('287', '玄冰弓', '5', '0', '0', '3', '0', '0', '1804', '0', '0', '4', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '1.400', '1.400', '12', '1.400', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '0', '0');
INSERT INTO `weapon_skill` VALUES ('288', '天雷劍', '4', '0', '0', '0', '0', '0', '10', '0', '0', '8', '0', '1', 'STAT_SCALE', '1', '0.000', '0.000', '2.000', '2.000', '12', '2.000', '0.000', '0.000', '0', '55', '12', '0.200', '0.00', '0.00', '0', '1', '0');
